Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: དཔྲལ་བའི་དབྱེས་ཆེ་བ། སྨིན་མ་འཇར་བ། སྣའི་གཟངས་མཐོ་བ། ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་དང་ལྡན་པ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་བཅུ་རྩ་གཉིས་ཀྱིས་ཀུན་ནས་བརྒྱན་པའི་ལུས་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་།
en: He was well proportioned, attractive, pleasant to behold, and gold in complexion, his head like a parasol and with long arms, a broad forehead, eyebrows that meet, a prominent nose, and every major limb and minor appendage of his body complete, and his body was fully ornamented with the thirty-two marks of a great man.

source: །བྱུང་མ་ཐག་ཏུ་བཙུན་མོའི་འཁོར་གྱི་ནང་དུ་བཀྲི་བ་དང་། རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ཀྱི་བཙུན་མོ་བརྒྱད་ཁྲིས་གཞོན་ནུ་མཐོང་ནས་ནུ་མ་རྣམས་ལས་འོ་མ་ཟགས་པ་དང་། བུད་མེད་རེ་རེས་ཀྱང་ང་ལས་ནུ་ང་ལས་ནུ་ཞེས་སྨྲས་པས་དེའི་མིང་ང་ལས་ནུ་ང་ལས་ནུ་ཞེས་བྱ་བར་གྱུར་ཏོ།
en: “Soon after birth, he was brought to the harem. As soon as the eighty thousand consorts of King Upoṣadha saw the prince, milk squirted out from all of their breasts, and each said, ‘Suckle at my breast (*mān dhaya)!’ Therefore, he was named Māndhātṛ.

source: །གཞན་དག་ན་རེ་འདི་སྤྱི་བོ་ལས་སྐྱེས་པས་དེའི་ཕྱིར་གཞོན་ནུའི་མིང་སྤྱི་བོ་སྐྱེས་ཞེས་བྱའོ་ཞེས་ཟེར་ཏོ།
en: Other people said that since he had been born (jāta) from the crown of the head (mūrdhnā), the prince should be named Mūrdhnāta.

source: །དེ་ན་ཁ་ཅིག་གིས་ནི་ང་ལས་ནུ་ཞེས་བྱ་བར་ཤེས་སོ།
en: There some people knew him as Māndhātṛ

source: །ཁ་ཅིག་གིས་ནི་སྤྱི་བོ་སྐྱེས་ཞེས་བྱ་བར་ཤེས་སོ། །གཞོན་ནུ་ང་ལས་ནུ་གཞོན་ནུའི་རྩེད་མོས་རྩེ་བ་ལ་བརྒྱ་བྱིན་དྲུག་ཤི་འཕོས་པ་ལོན་ནོ།
en: and others as Mūrdhnāta. “While Prince Māndhātṛ

source: །རྒྱལ་ཚབ་ལ་གནས་པ་ལ་བརྒྱ་བྱིན་དྲུག་ཤི་འཕོས་པ་ལོན་ནོ།
en: was playing princely games, six successive Śakras died. While he was in the position of crown prince, another six successive Śakras died.

source: །གཞོན་ནུ་ང་ལས་ནུ་ཡུལ་ཞིག་ཏུ་སོང་སྟེ།
en: “One day Prince Māndhātṛ went to the countryside.

source: དེ་ཡུལ་དུ་ཕྱིན་པ་དང་རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ན་བར་གྱུར་ནས་དེ་རྩ་བ་དང་། སྡོང་བུ་དང་། ལོ་མ་དང་། མེ་ཏོག་དང་། འབྲས་བུའི་སྨན་གྱིས་སྙེན་བཀུར་བྱས་ན་ཡང་ཕྱིར་ཐུ་བ་ཁོ་ནར་གྱུར་ནས་དེས་བློན་པོ་རྣམས་ལ་བསྒོ་བ།
en: After he had gone to the countryside, King Upoṣadha became sick. Although he was provided with medicines derived from roots, stalks, leaves, flowers, and fruits, the illness just kept on getting worse.

source: ཤེས་ལྡན་དག་མྱུར་དུ་གཞོན་ནུ་ལ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བས་དབང་བསྐུར་ཅིག །ལྷ་བཀའ་བཞིན་འཚལ་ཞེས་བློན་པོ་རྣམས་ཀྱིས་ཕོ་ཉ་བཀུག་སྟེ་རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་བསྙུང་ནས།
en: He ordered his ministers, ‘Sirs, anoint the prince as king quickly.’ “ ‘Certainly, Your Majesty.’ “The ministers sent a messenger, saying, ‘King Upoṣadha has become sick.

source: དེས་གཞོན་ནུ་སྤྱན་དྲོངས་ལ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་ཉམས་སུ་མྱོང་བར་གྱིས་ཤིག་ཅེས་བཀའ་སྩལ་གྱིས། གཞོན་ནུ་མྱུར་དུ་བྱོན་པའི་རིགས་སོ་ཞེས་སྤྲིང་ངོ་། །དེ་ཆས་པ་དང་རྒྱལ་པོ་གསོ་སྦྱོང་འཕགས་ཤིའོ།
en: He said, “Call the prince and let him accept the royal anointing.” Hence the prince should come quickly.’ When the messenger had departed, King Upoṣadha died.

source: །དེ་ནས་བློན་པོ་དག་གིས་ཡང་ཕོ་ཉ་གཞན་ཞིག་གཏོང་བ་ལ་གཞོན་ནུ་ཁྱོད་ཀྱི་ཡབ་ནི་ནོངས་ཀྱིས།
en: Then the ministers sent another messenger, saying, ‘O Prince, your father has passed away.

source: ཚུར་སྤྱོན་རྒྱལ་སྲིད་བཞེས་ཤིག་ཅེས་སྤྲིང་ངོ་།
en: Please come and accept the kingdom.’

source: །གཞོན་ནུ་ང་ལས་ནུས་བསམས་པ།
en: “Prince Māndhātṛ

source: གལ་ཏེ་བདག་གི་ཡབ་ནོངས་ན། དེར་སོང་ཡང་ཅི་ཕན་སྙམ་དུ་བསམས་ནས་དེ་ཉིད་ན་འདུག་གོ། །བློན་པོ་རྣམས་ཡང་འདུས་ནས་བློན་པོ་ཞིག་ཕོ་ཉར་བཏང་བ་དང་དེར་སོང་ནས་སྨྲས་པ།
en: stayed there, thinking, ‘Since my father has passed away, what use is there in my going there?’ The ministers again met together and sent a minister as a messenger.

source: གཞོན་ནུ་རྒྱལ་སྲིད་བཞེས་ཤིག །དེས་སྨྲས་པ།
en: He went to the prince and requested, ‘O Prince, please accept the kingdom.’

source: གལ་ཏེ་ཁོ་བོས་ཆོས་དང་མཐུན་པས་རྒྱལ་སྲིད་འཐོབ་པར་འགྱུར་ན་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བ་འདི་ཉིད་དུ་འོང་བར་འགྱུར་རོ།
en: “ ‘If I obtain the kingdom according to the Dharma,’ replied the prince, ‘the royal anointing will take place here.’

source: རིན་པོ་ཆེའི་གཅལ་དང་། སེང་གེའི་ཁྲི་དང་། གདུགས་དང་། ཅོད་པན་དང་། དཔུང་རྒྱན་གྱིས་ཕོ་བྲང་གི་ནང་དུ་རྒྱལ་སྲིད་ཀྱི་དབང་བསྐུར་བར་བགྱི་འཚལ་བས་དེ་ལྟ་བས་ན་གཞོན་ནུ་འདི་ཉིད་དུ་བྱོན་པའི་རིགས་སོ།
en: We perform the royal anointing in the palace on a jeweled floor with a throne, parasol, crown, and bracelet. Therefore, the prince must come to this very place.’

source: །དེས་སྨྲས་པ། ངས་ཆོས་དང་མཐུན་པར་རྒྱལ་སྲིད་འཐོབ་པ་ལྟ་ན་ཐམས་ཅད་འདི་ཉིད་དུ་འོང་བར་འགྱུར་རོ།
en: “ ‘If I obtain the kingdom according to the Dharma,’ replied the prince, ‘everything necessary will appear here.’

source: །གཞོན་ནུ་ང་ལས་ནུའི་མདུན་ནས་འགྲོ་བ་གནོད་སྦྱིན་ལྷ་གནས་ཞེས་བྱ་བ་དེས་རིན་པོ་ཆེའི་གཅལ་དང་། སེང་གེའི་ཁྲི་དེ་ཉིད་དུ་བླངས་སོ།
en: “A yakṣa named Divaukasa, attendant on Prince Māndhātṛ, brought there a jeweled floor and throne.

source: །ཕོ་བྲང་ན་གནས་པ་རྣམས་ཀྱིས་ཀྱང་གདུགས་དང་། ཅོད་པན་དང་། དཔུང་རྒྱན་ཁྱེར་ནས་རང་དེ་ཉིད་དུ་ལྷགས་ཏེ།
en: People living in the palace then spontaneously came together, bringing a parasol, crown, and bracelet.

source: ཕོ་བྲང་འཁོར་བ་རང་ལྷགས་པས་གནས་དེའི་མིང་གནས་བཅས་གནས་བཅས་ཞེས་བྱ་བར་གྲགས་སོ།
en: Since the people living in the palace spontaneously (svayaṃ) came (āgata), the place was named Sāketā.

source: །ཕྱིས་བློན་པོ་དེ་རྣམས་དང་། ཁྲོམ་གྱི་རུ་པ་དང་། གྲོང་མི་དང་། ཡུལ་མི་རྣམས་ཀྱིས་ནི་དབང་བསྐུར་བ་ཁྱེར་ཏེ་དོང་ནས་དེ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “Thereupon the ministers, army, citizens, and provincial dwellers also brought there the water for the royal anointing.

source: ལྷ་དབང་བསྐུར་བ་བཞེས་སུ་གསོལ།
en: They said, ‘Your Majesty, please accept the royal anointing.’

source: དེས་སྨྲས་པ། ང་མི་རྣམས་ཀྱིས་ཅོད་པན་བཅིང་ངམ།
en: “ ‘Am I being crowned by humans?’ he replied.

source: གལ་ཏེ་ཆོས་ཀྱི་རྒྱལ་སྲིད་འཐོབ་ན་མི་མ་ཡིན་པ་རྣམས་ཀྱིས་ཅོད་པན་འཆིང་གྲང་།
en: ‘If I obtain the kingdom according to the Dharma, I will be crowned by nonhumans.’

source: ཇི་ཙམ་ན་དེ་མི་མ་ཡིན་པ་རྣམས་ཀྱིས་ཅོད་པན་བཅིངས་པ་དང་། དེའི་རིན་པོ་ཆེ་སྣ་བདུན་བྱུང་བ་འདི་ལྟ་སྟེ།
en: “Thus, he was crowned by nonhumans, and his seven treasures appeared:

source: འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བདུན་པ་བློན་པོ་རིན་པོ་ཆེ་ཉིད་དོ།
en: namely, the precious chakra, elephant, horse, jewel, woman, householder, and minister.

source: །དེ་ལ་བུ་དཔའ་བ་རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པར་བྱེད་པ་སྟོང་ཡང་ཚང་བར་བྱུང་ངོ་།
en: He had a thousand sons who were brave, bold, and endowed with excellent physiques, and who would defeat the enemy’s army.

source: །ཡངས་པ་ཅན་གྱི་ཉེན་ཀོར་ན་ནགས་ཚལ་སྟུག་པོ་དག་དགའ་དགའ་ལྟར་འདུག་པ་ཞིག་ཡོད་པ་དེ་ན་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་ལྔ་བརྒྱ་བསམ་གཏན་བྱེད་དོ། །ནགས་ཚལ་སྟུག་པོ་དེ་ན་ཡང་བྱ་གར་རབ་ཏུ་མང་པོ་དག་ཅིག་ཀྱང་གནས་སོ།
en: “There were comfortable woods near Vaiśālī, and there lived five hundred ṛṣis who had the five kinds of supernormal knowledge. There lived many birds in the woods, too.

source: །བསམ་གཏན་གྱི་ཚེར་མ་ནི་སྒྲ་ཡིན་པས་བྱ་གར་རྣམས་ལྡིང་ཞིང་སྐད་འབྱིན་པར་བྱེད་པ་དང་། དེ་ནས་དྲང་སྲོང་རང་བཞིན་ངན་ཞེས་བྱ་བ་ཞིག་ཡོད་པ་དེ་འཁྲུགས་ནས་དེས་བྱ་གར་རྣམས་ལ་འདབ་གཤོག་རྣམས་ལྷགས་པར་ཤོག་ཤིག་ཅེས་དམོད་པ་བོར་རོ།
en: Since dhyāna is disturbed by voices, when the birds in flight made a sound, a ṛṣi named Durmukha became angry and cursed them:

source: །དེ་རྣམས་དྲང་སྲོང་འཁྲུགས་པས་འདབ་གཤོག་རྣམས་ལྷགས་པར་གྱུར་ཏོ།
en: ‘May your wings be broken!’ Their wings did break on account of the angry ṛṣi, and so they began to walk.

source: །དེ་ནས་དེ་རྣམས་རྐང་པས་འགྲོ་བར་བརྩམས་པ་དང་། རྒྱལ་པོ་དེ་ཡང་ལྗོངས་རྒྱུར་སོང་བས་བྱ་གར་རྣམས་རྐང་པས་འགྲོ་བ་མཐོང་ངོ་། །དེ་ནས་དེས་བློན་པོ་རྣམས་ལ་དྲིས་པ་ཅིའི་ཕྱིར་བྱ་གར་འདི་རྣམས་རྐང་པས་འགྲོ་བར་གྱུར། བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ།
en: “When the king was traveling through the country, he saw the birds walking and asked his ministers, ‘Why are these birds walking?’

source: ལྷ་བསམ་གཏན་གྱི་ཚེར་མ་ནི་སྒྲ་ལགས་པས་དྲང་སྲོང་འཁྲུགས་པ་དག་གིས་འདི་རྣམས་ལ་དམོད་པ་བོར་བ་དང་། དེ་ནས་དྲང་སྲོང་འཁྲུགས་པས་འདི་རྣམས་ཀྱི་འདབ་གཤོག་རྣམས་ལྷགས་པར་གྱུར་ཏོ།
en: “ ‘Your Majesty, since dhyāna is disturbed by voices, angry ṛṣis cursed the birds, and so their wings broke on account of the angry ṛṣis.’

source: །དེ་ནས་རྒྱལ་པོས་སྨྲས་པ། གང་དག་སེམས་ཅན་རྣམས་ལ་སྙིང་བརྩེ་བ་མེད་པའི་དྲང་སྲོང་འདི་ལྟ་བུ་ཡང་ཡོད་པ་ལྟ་ཞེས་སྨྲས་ནས། ཤེས་ལྡན་དག་དེང་ལ་དྲང་སྲོང་རྣམས་ལ་ཁྱེད་ཅག་ངའི་ཡུལ་ན་མ་འདུག་ཤིག་ཅེས་སྒོ་ཤིག་ཅེས་སྨྲས་སོ།
en: “ ‘There seem to be such ṛṣis who are not compassionate toward beings,’ the king remarked, and then he ordered, ‘Sirs, command the ṛṣis today not to live in my land.’

source: །དེ་ནས་བློན་པོ་རྣམས་དྲང་སྲོང་གི་ཐད་དུ་དོང་ནས་བསྒོ་བ།
en: “The ministers went to the ṛṣis and conveyed the order:

source: རྒྱལ་པོའི་ཞལ་ནས་ཁྱེད་ཅག་ངའི་ཡུལ་ན་མ་འདུག་ཤིག་ཅེས་བཀའ་སྩལ་ཏོ།
en: ‘It was uttered from His Majesty’s lips: “You must not live in my land.” ’

source: །དྲང་སྲོང་རྣམས་ཀྱིས་བསམས་པ། རྒྱལ་པོ་འདི་ནི་གླིང་བཞི་ལ་དབང་བ་ཡིན་པས་རི་རབ་ཀྱི་བང་རིམ་དུ་འགྲོའོ་སྙམ་ནས། དེ་རྣམས་དེར་དོང་སྟེ་གནས་སོ།
en: “The ṛṣis thought, ‘Since this king is the ruler of the four continents, let us go to the terrace of Mount Sumeru.’ They went there and settled in.

source: །རྒྱལ་པོ་ང་ལས་ནུའི་མི་རྣམས་ནི་སེམས་པར་བྱེད་པ་དང་། འཇལ་བར་བྱེད་པ་དང་། ཉེ་བར་རྟོག་པར་བྱེད་པ་ཡིན་ཏེ།
en: “King Māndhātṛ’s people were thinkers, measurers, and investigators.

source: དེ་དག་གིས་བསམས་ཤིང་ཉེ་བར་བརྟགས་ནས་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་ཐ་དད་པ་རྣམས་བྱ་བར་བརྩོན་པས་དེ་རྣམས་སེམས་པར་བྱེད་པ་དང་། འཇལ་བར་བྱེད་པ་དང་། ཉེ་བར་རྟོག་པར་བྱེད་པ་ཡིན་པའི་ཕྱིར་མིང་ཤེད་ལས་སྐྱེས་ཤེད་ལས་སྐྱེས་ཞེས་བྱ་བར་གྲགས་སོ།
en: Thinking and investigating, they exerted themselves in their respective arts and technical skills. Since they were thinkers, measurers, and investigators, they were named ‘born from thought’ (manuja, ‘human being’). “They began to work in the fields.

source: །དེ་རྣམས་ཀྱིས་ཞིང་ལས་དག་བྱ་བར་བརྩམས་པ་དང་། རྒྱལ་པོ་ལྗོངས་རྒྱུར་སོང་བས་མི་དེ་རྣམས་ཞིང་ལས་དག་བྱེད་པར་མཐོང་ནས་དེས་བློན་པོ་རྣམས་ལ་སྨྲས་པ། མི་འདི་རྣམས་ཅི་ཞིག་བྱེད།
en: When the king was traveling through the country, he saw the people working in the fields, and he asked his ministers, ‘What are these people doing?’

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་སྨན་དུ་འགྱུར་བར་བགྱི་བའི་སླད་དུ་ལོ་ཐོག་ལ་སོགས་པ་སྐྲུན་པ་ལགས་སོ། །རྒྱལ་པོས་སྨྲས་པ།
en: “ ‘Your Majesty,’ replied the ministers, ‘they are growing grains and so on in order to make medicine from them.’

source: ཅི་བདག་གི་རྒྱལ་སྲིད་ཀྱི་མི་རྣམས་ཞིང་ལས་བྱེད་དམ། དེ་ནས་དེས་སྨྲས་པ།
en: “The king wondered, ‘Why do the people in my land have to work in the fields?’ Then he said, ‘The gods should cause a rain of twenty-seven kinds of seeds.’

source: ལྷས་ས་བོན་གྱི་རིགས་ཉི་ཤུ་རྩ་བདུན་གྱི་ཆར་ཕོབ་ཤིག་ཅེས་བྱས་པ་དང་། རྒྱལ་པོ་ང་ལས་ནུས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ལྷས་ས་བོན་གྱི་རིགས་ཉི་ཤུ་རྩ་བདུན་གྱི་ཆར་ཕབ་བོ།
en: “As soon as King Māndhātṛ had wished this, the gods did cause a rain of twenty-seven kinds of seeds. King Māndhātṛ

source: །རྒྱལ་པོ་ང་ལས་ནུས་ཡུལ་མི་རྣམས་ལ་དྲིས་པ། འདི་དག་སུའི་བསོད་ནམས་ཀྱིས་བྱུང་།
en: asked his provincial dwellers, ‘Whose merit caused these?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷའི་ཡང་ལགས། བདག་ཅག་གི་ཡང་ལགས་སོ།
en: “ ‘Both Your Majesty’s and ours did,’ they answered.

source: །ཡང་མི་དེ་རྣམས་རས་བལ་གྱི་ཞིང་རྨོ་བར་བརྩམས་པ་དང་། ཡང་རྒྱལ་པོ་ང་ལས་ནུ་ལྗོངས་རྒྱུར་སོང་བས་མཐོང་ནས།
en: “Then, the people began to plow the cotton fields. Again, when King Māndhātṛ

source: དེས་བློན་པོ་རྣམས་ལ་སྨྲས་པ། མི་འདི་རྣམས་ཅི་ཞིག་བྱེད།
en: was traveling through the country, he saw them and asked his ministers, ‘What are these people doing?’

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་མི་འདི་རྣམས་ནི་རས་བལ་གྱི་ཞིང་རྨེད་ལགས་སོ།
en: “ ‘Your Majesty, these people are plowing the cotton fields,’ the ministers replied.

source: །རྒྱལ་པོས་སྨྲས་པ། ཅི་ཞིག་ཏུ་དགོས།
en: “ ‘What need is there?’ asked the king.

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་གོས་བགྱི་བའི་སླད་དུའོ། །དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུས་སྨྲས་པ།
en: “ ‘Your Majesty,’ they explained, ‘they do this in order to make clothes.’

source: ཅི་ངའི་རྒྱལ་སྲིད་ཀྱི་མི་རྣམས་རས་བལ་གྱི་ཞིང་རྨེད་དམ།
en: “ ‘Why do the people in my land have to plow the cotton fields?’ King Māndhātṛ wondered. ‘The gods should cause a rain of cotton.’ “As soon as King Māndhātṛ

source: ལྷས་རས་བལ་ཁོ་ནའི་ཆར་ཕོབ་ཅིག་ཅེས་བྱས་པ་དང་། རྒྱལ་པོ་ང་ལས་ནུས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ལྷས་རས་བལ་ཁོ་ནའི་ཆར་ཕབ་བོ།
en: had thought this, the gods did cause a rain of cotton seeds.

source: །རྒྱལ་པོས་ཡུལ་མི་རྣམས་ལ་དྲིས་པ། འདི་དག་སུའི་བསོད་ནམས་ཀྱིས་བྱུང་།
en: King Māndhātṛ asked his provincial dwellers, ‘Whose merit caused these?’

source: །ཡང་མི་དེ་རྣམས་རས་བལ་དེ་རྣམས་འཁལ་བར་བརྩམས་པ་དང་། རྒྱལ་པོས་སྨྲས་པ། མི་འདི་དག་ཅི་ཞིག་བྱེད།
en: “Then, these people began to spin the cotton, and the king asked, ‘What are these people doing?’

source: བློན་པོ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་སྐུད་པ་འཚལ་བའི་སླད་དུ་རས་བལ་དེ་འཁལ་ལགས་སོ།
en: “ ‘Your Majesty, they are spinning cotton into thread,’ said the ministers.

source: །རྒྱལ་པོས་སྨྲས་པ། ཅི་ངའི་རྒྱལ་སྲིད་ཀྱི་མི་རྣམས་རས་སྐུད་འཁལ་ལམ།
en: “ ‘Why do the people in my land have to spin cotton into thread?’ the king wondered.

source: ལྷས་རས་སྐུད་ཀྱི་ཆར་ཁོ་ན་ཕོབ་ཤིག་ཅེས་བྱས་པ་དང་། རྒྱལ་པོ་ང་ལས་ནུས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ལྷས་རས་སྐུད་ཁོ་ནའི་ཆར་ཕབ་བོ།
en: ‘The gods should cause a rain of cotton threads.’ “As soon as King Māndhātṛ had thought this, the gods did cause a rain of cotton threads.

source: །རྒྱལ་པོ་དེས་སྨྲས་པ། འདི་དག་སུའི་བསོད་ནམས་ཀྱིས་བྱུང་།
en: The king asked, ‘Whose merit caused these?’

source: །དེ་ནས་རིམ་གྱིས་རས་འཐག་པར་བརྩམས་པ་དང་། རྒྱལ་པོས་སྨྲས་པ། འདི་དག་ཅི་ཞིག་བྱེད།
en: “After that, they began in due course to weave the cotton. The king asked, ‘What are they doing?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷ་གོས་སུ་བགྱི་བའི་སླད་དུ་རས་འཐག་ལགས་སོ། །རྒྱལ་པོས་བསམས་པ། ད་ཅི་ངའི་རྒྱལ་སྲིད་ཀྱི་མི་རྣམས་རས་འཐག་གམ་སྙམ་ནས།
en: “ ‘Your Majesty,’ they said, ‘they are weaving cotton into cloth.’ “ ‘Why do the people in my land have to weave cotton into cloth?’ King Māndhātṛ wondered. ‘The gods should cause a rain of cotton cloth.’ “As soon as King Māndhātṛ

source: ལྷས་རས་ཉིད་ཀྱི་ཆར་ཕོབ་ཤིག་ཅེས་བྱས་པ་དང་། རྒྱལ་པོ་ང་ལས་ནུས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ལྷས་རས་ཉིད་ཀྱི་ཆར་ཕབ་བོ།
en: had thought this, the gods did cause a rain of cotton cloth.

source: །རྒྱལ་པོས་དྲིས་པ་འདི་དག་སུའི་བསོད་ནམས་ཀྱིས་བྱུང་།
en: The king asked, ‘Whose merit caused these?’

source: །རྒྱལ་པོས་བསམས་པ། མི་འདི་རྣམས་ནི་བདག་གི་བསོད་ནམས་དག་གི་མཐུ་རབ་ཏུ་མི་ཤེས་ཏེ།
en: “The king thought, ‘These people do not realize the power of my merits.

source: བདག་ལ་འཛམ་བུའི་གླིང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་ཡང་ཡོད།
en: I have the continent of Jambu, which is rich, prosperous, peaceful, abundant in food, and full of many people.

source: བདག་ལ་རིན་པོ་ཆེ་སྣ་བདུན་འདི་ལྟ་སྟེ།
en: I have seven treasures:

source: འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བཙུན་མོ་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བདུན་པ་བློན་པོ་རིན་པོ་ཆེ་ཡང་ཡོད།
en: namely, the precious chakra, elephant, horse, jewel, woman, householder, and minister.

source: བདག་ལ་བུ་དཔའ་བ་རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པར་བྱེད་པ་སྟོང་ཡང་ཚང་བར་ཡོད་ཀྱིས།
en: I have a thousand sons who are brave, bold, and endowed with excellent physique, and who will defeat the enemy’s army.

source: ཀྱེ་མ་བདག་གི་ཕོ་བྲང་གི་ནང་དུ་རིན་པོ་ཆེའི་ཆར་འབབ་ཅིང་དེ་ལས་ཕྱི་རོལ་དུ་ནི་ཀཱར་ཥཱ་པ་ཎ་འགའ་ཡང་མི་འབབ་པར་གྱུར་ཅིག་སྙམ་པ་དང་། རྒྱལ་པོ་ང་ལས་ནུས་སེམས་བསྐྱེད་མ་ཐག་ཏུ་ཕོ་བྲང་གི་ནང་དུ་ཞག་བདུན་དུ་རིན་པོ་ཆེའི་ཆར་བབ་ལ། ཕྱི་རོལ་དུ་ནི་ཀཱར་ཥཱ་པ་ཎ་འགའ་ཡང་མ་བབ་སྟེ།
en: Now, may a rain of jewels fall in my palace, but not even a kārṣāpaṇa outside!’ “As soon as King Māndhātṛ had thought this, a rain of jewels did fall in the palace for seven days, but not even a kārṣāpaṇa fell outside.

source: ཇི་ལྟར་མཐུ་ཆེན་པོ། རྫུ་འཕྲུལ་ཆེན་པོ་བསོད་ནམས་བྱས་པ། དགེ་བ་བྱས་པ་རང་གི་བསོད་ནམས་ཀྱི་འབྲས་བུ་སོ་སོར་ཉམས་སུ་མྱོང་བ་བཞིན་ནོ།
en: It looked like someone possessing great dignity and great magical power, having made merit and performed good deeds, was enjoying the fruit of his merit.

source: །རྒྱལ་པོས་སྨྲས་པ། འདི་དག་སུའི་བསོད་ནམས་ཀྱིས་བྱུང་།
en: The king asked, ‘Whose merit caused these?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷའི་ལགས་སོ།
en: “ ‘Your Majesty’s did,’ they answered.

source: །རྒྱལ་པོས་སྨྲས་པ། ཤེས་ལྡན་དག་ཁྱེད་ཀྱིས་ཉེས་ཏེ།
en: “The king said, ‘Sirs, you are wrong.

source: གལ་ཏེ་ཁྱེད་ཀྱིས་ལྷའི་བསོད་ནམས་ཀྱིས་ལགས་སོ་ཞེས་སྨྲས་པ་དང་། ངས་འཛམ་བུའི་གླིང་མཐའ་དག་ཏུ་རིན་པོ་ཆེའི་ཆར་ཕབ་པར་འགྱུར་བ་ཞིག །འོན་ཀྱང་ཁྱེད་ལས་རིན་པོ་ཆེ་སུ་འདོད་པ་དེས་རིན་པོ་ཆེ་ཅི་འདོད་པ་དག་ལོང་ཤིག །དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུ་དེ་རྒྱལ་སྲིད་ཆེན་པོའི་དབང་བྱེད་དུ་འཇུག་པ་ལ་བརྒྱ་བྱིན་དྲུག་ཤི་འཕོས་པ་ལོན་ནོ།
en: If you had first said, “Your Majesty’s merit did,” I would have caused a rain of jewels throughout the continent of Jambu. But whoever wants jewels among you can take as many jewels as he wants.’ “After that, while King Māndhātṛ was ruling over the great kingdom, six successive Śakras died.

source: །ང་ལས་ནུའི་མདུན་ནས་འགྲོ་བ་གནོད་སྦྱིན་ལྷ་གནས་ཞེས་བྱ་བ་དེ་ལ་རྒྱལ་པོས་སྨྲས་པ། གང་ངས་བཀའ་སྩལ་དགོས་པ་བཀའ་འོག་ཏུ་མ་ཆུད་པའི་གླིང་གཞན་འགའ་ལྟ་ཡོད་དམ།
en: “The king asked the yakṣa named Divaukasa, attendant on Māndhātṛ, ‘Is there any other continent where they do not obey my orders?’

source: ལྷ་གནས་ཀྱིས་སྨྲས་པ། ལྷ་ཤར་གྱི་ལུས་འཕགས་ཞེས་བགྱི་བའི་གླིང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་མཆིས་ཀྱིས།
en: “ ‘Your Majesty,” Divaukasa answered, ‘there is a continent called Videha in the east, which is rich, prosperous, peaceful, abundant in food, and full of many people.

source: ལྷ་དེར་གཤེགས་ཏེ་བཀའ་སྩལ་དུ་གསོལ།
en: May Your Majesty go to that continent and rule it.’

source: དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Then King Māndhātṛ

source: བདག་ལ་རིན་པོ་ཆེ་སྣ་བདུན་འདི་ལྟ་སྟེ། འཁོར་ལོ་རིན་པོ་ཆེ་དང་། གླང་པོ་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བདུན་པ་བློན་པོ་རིན་པོ་ཆེ་ཡང་ཡོད།
en: I have seven treasures: namely, the precious chakra, elephant, horse, jewel, woman, householder, and minister.

source: བདག་ལ་བུ་དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་དང་ལྡན་པ། ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ་སྟོང་ཡང་ཚང་།
en: I have a thousand sons who are brave, bold, and endowed with excellent physiques, and who will defeat the enemy’s army.

source: བདག་གི་ཕོ་བྲང་གི་ནང་དུ་ཡང་རིན་པོ་ཆེའི་ཆར་ཞག་བདུན་དུ་བབ་ན།
en: Also, a rain of jewels fell in my palace for seven days.

source: ཤར་གྱི་ལུས་འཕགས་ཞེས་བྱ་བའི་གླིང་ཞིག་ཡོད་ཅེས་གྲག་གིས།
en: But it is said that there is another continent, which is called Videha in the east.

source: མ་ལ་བདག་དེར་ཡང་སོང་ལ་རྗེས་སུ་བསྟན་པར་བྱའོ་སྙམ་པ་དང་། སེམས་བསྐྱེད་མ་ཐག་ཏུ་རྒྱལ་པོ་ང་ལས་ནུ་དཔུང་གི་ཚོགས་བྱེ་བ་བརྒྱད་འབུམ་དང་ཐབས་ཅིག་ཏུ་བུ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ནས་མདུན་ནས་འགྲོ་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ནམ་མཁའ་ལ་འཕགས་ཏེ།
en: I will now go to that continent and rule over it.’ “As soon as he had thought this, King Māndhātṛ flew with an army of eight trillion up into the sky, surrounded by his thousand sons and preceded by his seven treasures.

source: རྒྱལ་པོ་ང་ལས་ནུ་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་དུ་ཆས་ནས་རྒྱལ་པོ་ང་ལས་ནུ་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་དུ་གནས་ཏེ།
en: King Māndhātṛ went to Videha in the east and lived there.

source: རྒྱལ་པོ་ང་ལས་ནུས་ཇི་ལྟར་སེམས་ཅན་བསོད་ནམས་བྱས་པ། དགེ་བ་བྱས་པ། མཐུ་ཆེན་པོ།
en: Like a being possessing great dignity and great magical power, having made merit and performed good deeds, enjoying the fruit of his merit, King Māndhātṛ

source: རྫུ་འཕྲུལ་ཆེན་པོས་རང་གི་བསོད་ནམས་ཀྱི་འབྲས་བུ་ཉམས་སུ་མྱོང་བ་ལྟར་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་དུ་ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་རྗེས་སུ་བསྟན་པར་བྱས་སོ།
en: ruled over the continent of Videha in the east for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: །དེ་ཤར་གྱི་ལུས་འཕགས་གླིང་ན་རྗེས་སུ་སྟོན་པ་ལ་བརྒྱ་བྱིན་དྲུག་ཤི་འཕོས་པ་ལོན་ནོ།
en: While he was ruling over the continent of Videha in the east, six successive Śakras died.

source: །ཡང་རྒྱལ་པོ་ང་ལས་ནུས་གནོད་སྦྱིན་ལྷ་གནས་ལ་སྨྲས་པ།
en: “Again, King Māndhātṛ

source: བཀའ་འོག་ཏུ་མ་ཆུད་པའི་གླིང་གཞན་འགའ་ལྟ་ཡོད་དམ། ལྷ་གནས་ཀྱིས་སྨྲས་པ།
en: asked the yakṣa Divaukasa, ‘Is there any other continent where they do not obey my orders?’

source: ལྷ་ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཅེས་བྱ་བའི་གླིང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་མཆིས་ཀྱིས་ལྷ་དེར་ཡང་གཤེགས་ཏེ་རྗེས་སུ་བསྟན་དུ་གསོལ།། །།འདུལ་བ་གཞི། བམ་པོ་བཞི་བཅུ་རྩ་གཅིག་པ། དེ་ནས་རྒྱལ་པོ་ང་ལས་ནུ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “ ‘Your Majesty,’ Divaukasa answered, ‘there is a continent called Godānīya in the west, which is rich, prosperous, peaceful, abundant in food, and full of many people. May Your Majesty go to that continent and rule it.’ “Then King Māndhātṛ

source: བདག་ལ་འཛམ་བུའི་གླིང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་བ་ཡང་ཡོད། བདག་གི་ཕོ་བྲང་གི་ནང་དུ་ཡང་རིན་པོ་ཆེའི་ཆར་ཞག་བདུན་དུ་བབ།
en: thought, ‘I have the continent of Jambu, which is rich, prosperous, peaceful, abundant in food, and full of many people. I have seven treasures: namely, the precious chakra, elephant, horse, jewel, woman, householder, and minister. I have a thousand sons who are brave, bold, and endowed with excellent physiques, and who will defeat the enemy’s army. Also, a rain of jewels fell in my palace for seven days.

source: བདག་གིས་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་དུ་ཡང་ཕྱིན།
en: I went to the continent of Videha in the east, too.

source: ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་བདག་གིས་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་དུ་རྗེས་སུ་བསྟན་ན།
en: I ruled over the continent of Videha in the east for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཅེས་བྱ་བའི་གླིང་ཞིག་ཡོད་ཅེས་གྲག་གིས།
en: But it is said that there is another continent, which is called Godānīya in the west.

source: མ་ལ་བདག་དེར་ཡང་སོང་ལ་རྗེས་སུ་བསྟན་པར་བྱའོ་སྙམ་པ་དང་། སེམས་བསྐྱེད་མ་ཐག་ཏུ་རྒྱལ་པོ་ང་ལས་ནུ་དཔུང་གི་ཚོགས་བྱེ་བ་བརྒྱད་འབུམ་དང་ཐབས་ཅིག་ཏུ་བུ་སྟོང་གིས་ཡོངས་སུ་བསྐོར་ནས་མདུན་ནས་འགྲོ་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་སྟེང་གི་ནམ་མཁའ་ལ་འཕགས་ཏེ།
en: I will now go to that continent and rule over it.’ “As soon as he had thought this, King Māndhātṛ flew with an army of eight trillion up into the sky, surrounded by his thousand sons and preceded by his seven treasures.

source: རྒྱལ་པོ་ང་ལས་ནུ་ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཀྱི་གླིང་དུ་ཆས་ནས་རྒྱལ་པོ་ང་ལས་ནུ་ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཀྱི་གླིང་དུ་གནས་ཏེ།
en: King Māndhātṛ went to Godānīya in the west and lived there.

source: རྫུ་འཕྲུལ་ཆེན་པོས་རང་གི་བསོད་ནམས་ཀྱི་འབྲས་བུ་ཉམས་སུ་མྱོང་བ་ལྟར་ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཀྱི་གླིང་དུ་ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་རྗེས་སུ་བསྟན་པར་བྱས་སོ།
en: ruled over the continent of Godānīya in the west for many years—hundreds of years, thousands of years, hundreds of thousands of years.

source: །དེ་ནུབ་ཀྱི་བ་ལང་སྤྱོད་ཀྱི་གླིང་ན་རྗེས་སུ་སྟོན་པ་ལ་བརྒྱ་བྱིན་དྲུག་ཤི་འཕོས་པ་ལོན་ནོ།
en: While he was ruling over the continent of Godānīya in the west, six successive Śakras died.

source: ལྷ་བྱང་གི་སྒྲ་མི་སྙན་ཅེས་བགྱི་བའི་གླིང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། སྐྱེ་བོ་དང་། མི་མང་པོས་གང་ལ།
en: “ ‘Your Majesty,’ Divaukasa answered, ‘there is a continent called Kuru in the north, which is rich, prosperous, peaceful, abundant in food, and full of many people.

source: གཞན་ཡང་མི་དེ་དག་ནི་བདག་གིར་བགྱི་བ་མ་མཆིས་པ། ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པ་ཞིག་མཆིས་ཀྱིས།
en: Moreover, these people are free from both attachment and acquisitiveness.

source: ཀྱེ་མ་ལྷ་དེར་ཡང་གཤེགས་ཏེ། ཉིད་ཀྱི་དཔུང་གི་ཚོགས་རྣམས་ལ་རྗེས་སུ་བསྟན་དུ་གསོལ།
en: May Your Majesty go to that continent and there command your army!’

source: བདག་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་དུ་སོང་སྟེ་ཡང་ལོ་མང་པོ་དང་། ལོ་བརྒྱ་ཕྲག་མང་པོ་དང་། ལོ་སྟོང་ཕྲག་མང་པོ་དང་། ལོ་བརྒྱ་སྟོང་ཕྲག་མང་པོར་བདག་གིས་ཤར་གྱི་ལུས་འཕགས་ཀྱི་གླིང་དུ་རྗེས་སུ་བསྟན།
en: I went to the continent of Videha in the east, too. I ruled over the continent of Videha in the east for many years—hundreds of years, thousands of years, hundreds of thousands of years.
